import pandas as pd

# Завантаження даних з файлу StudentsPerformance.csv
df = pd.read_csv('StudentsPerformance.csv')

# Гіпотеза 1: Стандартний обід та оцінки
# Обчислюємо середні оцінки з математики, читання та письма для учнів зі стандартним обідом
standard_lunch_scores = df[df["lunch"] == "standard"][["math score", "reading score", "writing score"]].mean()

# Обчислюємо середні оцінки з математики, читання та письма для учнів, які отримують безкоштовний або зі знижкою обід
reduced_lunch_scores = df[df["lunch"] == "free/reduced"][["math score", "reading score", "writing score"]].mean()

# Виводимо результати
print("============================================================================================")
print("Оцінки учнів зі стандартним обідом:\n", standard_lunch_scores)
print("Оцінки учнів з безкоштовним або зі знижкою обідом:\n", reduced_lunch_scores)
print("============================================================================================")

# Гіпотеза 2: Освіта батьків та оцінки
# Обчислюємо середні оцінки з математики, читання та письма для учнів, батьки яких мають вищу освіту (бакалавр або магістр)
print("============================================================================================")
high_education_scores = df[df["parental level of education"].isin(["bachelor's degree", "master's degree"])]
high_education_avg = high_education_scores[["math score", "reading score", "writing score"]].mean()
print("============================================================================================")

# Обчислюємо середні оцінки з математики, читання та письма для учнів, батьки яких мають нижчий рівень освіти
low_education_scores = df[~df["parental level of education"].isin(["bachelor's degree", "master's degree"])]
low_education_avg = low_education_scores[["math score", "reading score", "writing score"]].mean()

# Виводимо результати
print("============================================================================================")
print("Оцінки учнів з батьками з вищою освітою:\n", high_education_avg)
print("Оцінки учнів з батьками з нижчим рівнем освіти:\n", low_education_avg)
print("============================================================================================")

# Гіпотеза 3: Стать та оцінки
# Обчислюємо середні оцінки з читання та письма для дівчат
female_scores = df[df["gender"] == "female"][["reading score", "writing score"]].mean()

# Обчислюємо середні оцінки з читання та письма для хлопців
male_scores = df[df["gender"] == "male"][["reading score", "writing score"]].mean()

# Виводимо результати
print("============================================================================================")
print("Оцінки дівчат (читання та письмо):\n", female_scores)
print("Оцінки хлопців (читання та письмо):\n", male_scores)
print("============================================================================================")
